# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'imagick'
brew 'node'
brew 'redis'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'there'
cask 'tor-browser'
cask 'tower2'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Exported list
brew 'ansible'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aspell'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'autossh'
brew 'awscli'
brew 'bat'
brew 'bcrypt'
brew 'brotli'
brew 'c-ares'
brew 'cairo'
brew 'cli53'
brew 'cmake'
brew 'composer'
brew 'coreutils'
brew 'cscope'
brew 'curl'
brew 'curl-openssl'
brew 'dnsmasq'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'fribidi'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'gmp'
brew 'gnutls'
brew 'go'
brew 'graphite2'
brew 'graphviz'
brew 'gtk+'
brew 'harfbuzz'
brew 'hicolor-icon-theme'
brew 'htop'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'isl'
brew 'jansson'
brew 'jemalloc'
brew 'jpeg'
brew 'libde265'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libheif'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libmetalink'
brew 'libmpc'
brew 'libomp'
brew 'libpng'
brew 'libpq'
brew 'libsodium'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libxml2'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lua'
brew 'macvim'
brew 'mcrypt'
brew 'mercurial'
brew 'mhash'
brew 'mpfr'
brew 'mysql'
brew 'ncftp'
brew 'ncurses'
brew 'nettle'
brew 'nghttp2'
brew 'nginx'
brew 'nmap'
brew 'node'
brew 'openexr'
brew 'openjpeg'
brew 'openldap'
brew 'openssl'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'php'
brew 'php@7.1'
brew 'php@7.2'
brew 'php@7.3'
brew 'pixman'
brew 'pkg-config'
brew 'postgresql'
brew 'powerlevel9k'
brew 'py2cairo'
brew 'pyenv'
brew 'pygobject'
brew 'pygtk'
brew 'python'
brew 'python@2'
brew 'qcachegrind'
brew 'qt'
brew 'readline'
brew 'rtmpdump'
brew 'ruby'
brew 's3fs'
brew 'socat'
brew 'sqlite'
brew 'telnet'
brew 'terraform'
brew 'terragrunt'
brew 'tidy-html5'
brew 'tmux'
brew 'tree'
brew 'unixodbc'
brew 'unrar'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'x265'
brew 'xz'
brew 'yamllint'
brew 'yarn'
brew 'zsh'
